function matchPhoneNumber(input) {

    let pattern = /(?:\s|^)\+359( |-)2\1\d{3}\1\d{4}\b/g;

    let match = pattern.exec(input);        // Изваждаме си първото съвпадение
    let validPhones = [];                   // Правим празен масив, в който да пълним валидните телефонни номера

    while (match !== null) {                // Докато намираме съвпадение, въртим цикъла 
        validPhones.push(match[0].trim());  // Към телефоните добавяме, нулевия индекс, което е телефона, и премахваме излишните празни пространства отзад и отпред 
        match = pattern.exec(input);        // Подменяме стойността на съвпадението
    }

    console.log(validPhones.join(", "));    // Принтираме валидните телефони, разделени със запетая и интервал 
}
matchPhoneNumber("+359 2 222 2222,359-2-222-2222, +359/2/222/2222, +359-2 222 2222 +359 2-222-2222, +359-2-222-222, +359-2-222-22222 +359-2-222-2222");