function argumentInfo(...params) {  // със SPREAD оператора, взимаме всички подадени параметри независимо колко са и ги правим на масив 

    const tally = {};                       // Създаваме празен обект, в който ще пазим видовете параметри и техния брой

    for (let param of params) {             // Минаваме по всеки параметър от параметрите 
        const type = typeof param;          // Изваждаме като променлива типа на параметъра 
        console.log(`${type}: ${param}`);   // Отпечатваме типа на параметъра и самият параметър 
        if (!tally.hasOwnProperty(type)) {  // Ако няма все още свойство с това име в обекта 
        // if (tally[type] === undefined) { // АЛТЕРНАТИВЕН НАЧИН ЗА ПРОВЕРКА ДАЛИ ИМА ТАКОВА СВОЙСТВО 
            tally[type] = 0;                // Създаваме свойството със първоначална стойност 0 
        }
        tally[type]++;                      // Ако имам такова свойство в обекта, просто увеличаваме стойността с 1 
    }

    const sorted = Object.entries(tally).sort((a, b) => b[1] - a[1]);
    // Взимаме ключа и стойността с Object.entries те стават на двойки от масиви и по тяхната стойност ги сортираме 

    for (let [key, value] of sorted) {    // Минаваме по сортирания масив с двойки, като го деструктурираме на ключ и стойност
        console.log(`${key} = ${value}`);   // Печатаме ключа и след това стойността 
    }
}
argumentInfo("cat", 42, function () {console.log("Hello world!");});