function buildAWall(array){

    array = array.map(Number)   // Преобразуваме стринговете то масива в числа 
    let crews = array.length    // Намираме колко екипа работят по стената 
    let concreteForDay = []     // Създаваме си празен масив, в който ще слагаме колко бетон ползват за ден 
    
    while (crews > 0){          // Докато има наличност на екипи ще въртим цикъла 
        let sortedArray = array.sort((a, b) => a - b)   // Сортираме числата по големина от сегашния ни масив 
        let max = sortedArray[array.length - 1]         // Най-голямото число винаги ни е последното от масива

        for (let i = max + 1; i <= 30; i++){           // Правим цикъл, с който най-голямото число трябва да стигне до 30 
            for (let j = 0; j < sortedArray.length; j++){   // След това правим цикъл, в който минаваме по всички екипи  
                sortedArray[j]++                            // и увеличаваме с 1 техния строеж 
            }
            concreteForDay.push(crews * 195)                // след всяко увеличаване(ден) + прибавяме какво количество са ползвали 
        }

        for (let k = 0; k < sortedArray.length; k++ ){      // След като най-голямото число стигне 30   
            if (sortedArray[k] === 30){                     // проверяваме дали дали и някое от другите не е стигнало 
                let indexOf30 = sortedArray.indexOf(30)     // намираме индекса на всеки екип, стигнал до 30
                sortedArray.splice(indexOf30, 1)            // Изтриваме го от списъка с екипи
                crews--                                     // Намаляваме екипите с 1 
            }
        }

    }

    let sum = 0                        // След като всички екипи са стигнали до 30, си създаваме променлива sum
    for (let money of concreteForDay) { // Минаваме по натрупания бетон за всеки ден
        sum += money                    // и смятаме неговото количество
    }
    
    console.log(concreteForDay.join(", ")); // Печатаме бетона ползван за всеки ден разделене по запетая и интервал
    console.log(`${sum * 1900} pesos`);     // Изчисляваме сумата похарчета за бетон и я печатаме 
}
buildAWall([17, 22, 17, 19, 17])