function matchDates(input){

    let pattern = /\b(?<day>\d{2})(.|-|\/)(?<month>[A-Z][a-z]{2})\2(?<year>\d{4})\b/g; // Трябва да започва с 2 цифри, като кръщаваме
    // тази група ден -> трябва да има група за вида разделител -> трябва да има една Главна буква след това 2 малки букви, които
    // кръщаваме месец -> трябва да има сепаратор викамае го с бек реферънс като посочваме номера на групата му -> 
    // трябва да има 4 цифри, като кръщаваме тази група година  

    let match = pattern.exec(input) ;        // Взимаме първото съвпадение от входа

    while (match !== null){                 // Докато има съвпадение въртим цикъла 

        let day = match.groups['day'];       // Правим променлива ден, която взимаме от съвпадението неговата група кръстена ден 
        let month = match.groups['month'] ;  // Правим променлива месец, която взимаме от съвпадението неговата група кръстена месец 
        let year = match.groups['year'];     // Правим променлива година , която взимаме от съвпадението неговата група кръстена година
        match = pattern.exec(input);        // Подменяме с новото съвпадение, ако има такова 
        console.log(`Day: ${day}, Month: ${month}, Year: ${year}`);  // Печатаме като достъпваме променливите с интерполационен стринг
    }
    
}
matchDates("13/Jul/1928, 10-Nov-1934, , 01/Jan-1951,f 25.Dec.1937 23/09/1973, 1/Feb/2016")