function lastKNumbersSequence(n, k){

    let output = [1]    // Правим масив, който винаги започва от 1 по условие 
    
    for (let i = 1; i < n; i++){    // Правим цикъл, който да добавя елемент всеки път към настоящия ни
        let lastK = output.slice(-k)    // Взимаме последните К-елемента от настоящия ни масив 
        let sum = 0                     // Създаваме си променлива, която сумира последните ни K-елемента 

        for (let j of lastK) {      // Правим цикъл, който да минава по получените ни К-елемента 
            sum += Number(j)        // Сумира ги в променливата
        }

        output.push(sum)        // След края на сумирането, полученото число го добавяме към масива ни.
    }
    
    console.log(output.join(" "))   // След като сме добавили, изискания брой n-елементи ги печатаме с разстояние между тях 
}
//lastKNumbersSequence(6, 3)
lastKNumbersSequence(8, 2)