processOddNumbers => processOddNumbers    // Правим функция, която от дясната страна на => извършва операции     
.filter((el,i) => i % 2 !== 0)   // Филтрираме елементите по израз, за да намерим нечетните индекси 
.map(el => el * 2)              // Преобразуваме елементите от масива, като ги умножим по 2
.reverse()                      // Обръщаме ги в обратен ред 
.join(" ")                      // Съединяваме ги с разстояние 

//processOddNumbers([10, 15, 20, 25]);
//processOddNumbers([3, 0, 10, 4, 7, 3])